internal/isdoc/testdata/foreign_currency.golden.xml

<?xml version="1.0" encoding="UTF-8"?>
<Invoice xmlns="urn:isdoc:invoice:6.0.2" version="6.0.2">
  <DocumentType>1</DocumentType>
  <ID>FV20250003</ID>
  <UUID>zfaktury-3</UUID>
  <IssuingSystem>ZFaktury</IssuingSystem>
  <IssueDate>2025-03-15</IssueDate>
  <TaxPointDate>2025-03-15</TaxPointDate>
  <VATApplicable>false</VATApplicable>
  <Note>Invoice in EUR.</Note>
  <LocalCurrencyCode>CZK</LocalCurrencyCode>
  <ForeignCurrencyCode>EUR</ForeignCurrencyCode>
  <CurrRate>25.34</CurrRate>
  <RefCurrRate>1.00</RefCurrRate>
  <AccountingSupplierParty>
    <Party>
      <PartyIdentification>
        <UserID>87654321</UserID>
        <ID>87654321</ID>
      </PartyIdentification>
      <PartyName>
        <Name>Jan Novak</Name>
      </PartyName>
      <PostalAddress>
        <StreetName>Dodavatelska 456</StreetName>
        <CityName>Brno</CityName>
        <PostalZone>60200</PostalZone>
        <Country>
          <IdentificationCode>CZ</IdentificationCode>
          <Name>Ceska republika</Name>
        </Country>
      </PostalAddress>
      <PartyTaxScheme>
        <CompanyID>CZ87654321</CompanyID>
        <TaxScheme>
          <Name>VAT</Name>
        </TaxScheme>
      </PartyTaxScheme>
      <Contact>
        <Telephone>+420987654321</Telephone>
        <ElectronicMail>jan@novak.cz</ElectronicMail>
      </Contact>
    </Party>
  </AccountingSupplierParty>
  <AccountingCustomerParty>
    <Party>
      <PartyIdentification>
        <UserID>DE987654</UserID>
        <ID>DE987654</ID>
      </PartyIdentification>
      <PartyName>
        <Name>EuroTech GmbH</Name>
      </PartyName>
      <PostalAddress>
        <StreetName>Berliner Str. 42</StreetName>
        <CityName>Berlin</CityName>
        <PostalZone>10115</PostalZone>
        <Country>
          <IdentificationCode>DE</IdentificationCode>
          <Name>DE</Name>
        </Country>
      </PostalAddress>
      <PartyTaxScheme>
        <CompanyID>DE123456789</CompanyID>
        <TaxScheme>
          <Name>VAT</Name>
        </TaxScheme>
      </PartyTaxScheme>
      <Contact>
        <Telephone>+49301234567</Telephone>
        <ElectronicMail>billing@eurotech.de</ElectronicMail>
      </Contact>
    </Party>
  </AccountingCustomerParty>
  <InvoiceLines>
    <InvoiceLine>
      <ID>1</ID>
      <InvoicedQuantity unitCode="hod">40.00</InvoicedQuantity>
      <LineExtensionAmount>3000.00</LineExtensionAmount>
      <LineExtensionAmountTaxInclusive>3000.00</LineExtensionAmountTaxInclusive>
      <LineExtensionTaxAmount>0.00</LineExtensionTaxAmount>
      <UnitPrice>75.00</UnitPrice>
      <UnitPriceTaxInclusive>75.00</UnitPriceTaxInclusive>
      <ClassifiedTaxCategory>
        <Percent>0</Percent>
        <VATCalculationMethod>0</VATCalculationMethod>
      </ClassifiedTaxCategory>
      <Item>
        <Description>Consulting services</Description>
      </Item>
    </InvoiceLine>
  </InvoiceLines>
  <TaxTotal>
    <TaxSubTotal>
      <TaxableAmount>3000.00</TaxableAmount>
      <TaxAmount>0.00</TaxAmount>
      <TaxInclusiveAmount>3000.00</TaxInclusiveAmount>
      <AlreadyClaimedTaxableAmount>0.00</AlreadyClaimedTaxableAmount>
      <AlreadyClaimedTaxAmount>0.00</AlreadyClaimedTaxAmount>
      <AlreadyClaimedTaxInclusiveAmount>0.00</AlreadyClaimedTaxInclusiveAmount>
      <DifferenceTaxableAmount>3000.00</DifferenceTaxableAmount>
      <DifferenceTaxAmount>0.00</DifferenceTaxAmount>
      <DifferenceTaxInclusiveAmount>3000.00</DifferenceTaxInclusiveAmount>
      <TaxCategory>
        <Percent>0</Percent>
      </TaxCategory>
    </TaxSubTotal>
    <TaxAmount>0.00</TaxAmount>
  </TaxTotal>
  <LegalMonetaryTotal>
    <TaxExclusiveAmount>3000.00</TaxExclusiveAmount>
    <TaxInclusiveAmount>3000.00</TaxInclusiveAmount>
    <AlreadyClaimedTaxExclusiveAmount>0.00</AlreadyClaimedTaxExclusiveAmount>
    <AlreadyClaimedTaxInclusiveAmount>0.00</AlreadyClaimedTaxInclusiveAmount>
    <DifferenceTaxExclusiveAmount>3000.00</DifferenceTaxExclusiveAmount>
    <DifferenceTaxInclusiveAmount>3000.00</DifferenceTaxInclusiveAmount>
    <PaidDepositsAmount>0.00</PaidDepositsAmount>
    <PayableAmount>3000.00</PayableAmount>
  </LegalMonetaryTotal>
  <PaymentMeans>
    <Payment>
      <PaidAmount>3000.00</PaidAmount>
      <PaymentMeansCode>42</PaymentMeansCode>
      <Details>
        <PaymentDueDate>2025-03-29</PaymentDueDate>
        <ID>1234567890</ID>
        <BankCode>0100</BankCode>
        <IBAN>CZ6508000000001234567890</IBAN>
        <BIC>KOMBCZPP</BIC>
        <VariableSymbol>20250003</VariableSymbol>
        <ConstantSymbol>0308</ConstantSymbol>
      </Details>
    </Payment>
    <PaymentDueDate>2025-03-29</PaymentDueDate>
  </PaymentMeans>
</Invoice>